---
kind: other
id: Methods.T:Autodesk.Revit.DB.LayoutRuleFixedNumber
source: html/3c9ab93b-8b94-6ffa-ab42-64cc92fb93a4.htm
---
# LayoutRuleFixedNumber Methods

Causes the object to release immediately any resources it may be utilizing.